function [eu,ev,ep]=lift(N,Eu,Ev,Ep)

    eu=zeros(N*2,N*2+1);
    eu(1:2:N*2-1,3:2:N*2-1)=Eu(:,2:N);%粗网格线-上方
    eu(2:2:N*2,3:2:N*2-1)=Eu(:,2:N);%粗网格线-下方
    eu(1:2:N*2-1,2:2:N*2)=Eu(:,1:N)/2+Eu(:,2:N+1)/2;%细网格线-上方
    eu(2:2:N*2,2:2:N*2)=Eu(:,1:N)/2+Eu(:,2:N+1)/2;%细网格线-下方

    ev=zeros(N*2+1,N*2);
    ev(3:2:N*2-1,1:2:N*2-1)=Ev(2:N,:);
    ev(3:2:N*2-1,2:2:N*2)=Ev(2:N,:);
    ev(2:2:N*2,1:2:N*2-1)=Ev(1:N,:)/2+Ev(2:N+1,:)/2;
    ev(2:2:N*2,2:2:N*2)=Ev(1:N,:)/2+Ev(2:N+1,:)/2;

    ep=zeros(N*2,N*2);
    ep(1:2:2*N-1,1:2:2*N-1)=Ep;
    ep(1:2:2*N-1,2:2:2*N)=Ep;
    ep(2:2:2*N,1:2:2*N-1)=Ep;
    ep(2:2:2*N,2:2:2*N)=Ep;
end